In [45]:
#Import Python Libraries
import numpy as np
import pandas as pd

In [46]:
print(pd. __version__)

2.2.2

In [47]:
score = [25, 47, 84, 74, 44, 35, 75, 7, 29, 82, 32, 25, 20, 63, 44, 58, 59, 67, 56, 85]
print("numpy sorted score",np.sort(score))
print("score",score)

numpy sorted score [ 7 20 25 25 29 32 35 44 44 47 56 58 59 63 67 74 75 82 84 85]
score [25, 47, 84, 74, 44, 35, 75, 7, 29, 82, 32, 25, 20, 63, 44, 58, 59, 67, 56, 85]

In [48]:
score = [25, 47, 84, 74, 44, 35, 75, 7, 29, 82, 32, 25, 20, 63, 44, 58, 59, 67, 56, 85]
print(sorted(score))
print(score)

[7, 20, 25, 25, 29, 32, 35, 44, 44, 47, 56, 58, 59, 63, 67, 74, 75, 82, 84, 85]
[25, 47, 84, 74, 44, 35, 75, 7, 29, 82, 32, 25, 20, 63, 44, 58, 59, 67, 56, 85]

In [49]:
score = [25, 47, 84, 74, 44, 35, 75, 7, 29, 82, 32, 25, 20, 63, 44, 58, 59, 67, 56, 85]
score.sort(reverse=True)
print(score)

[85, 84, 82, 75, 74, 67, 63, 59, 58, 56, 47, 44, 44, 35, 32, 29, 25, 25, 20, 7]

In [50]:
score = [25, 47, 84, 74, 44, 35, 75, 7, 29, 82, 32, 25, 20, 63, 44, 58, 59, 67, 56, 85]
print(np.mean(score))
print(np.std(score))
print("min = ", np.min(score))
# หา max

50.55
22.70346889794597
min =  7

In [51]:
#Read csv file
df = pd.read_csv("C:/Users/User/Desktop/DA/LAB-8-Aug-2024/Salaries.csv")

In [52]:
#Display a few first records
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [53]:
#Display first 10 records
df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [54]:
#Display the last 3 records
df.tail()

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [55]:
# Display lecturers who are Male
df['sex']=="female"

0     False
1     False
2     False
3     False
4     False
      ...
73    False
74    False
75    False
76    False
77    False
Name: sex, Length: 78, dtype: bool

In [56]:
# Display lecturer who are Male with all ranks
df[["sex","rank"]]

       sex       rank
0     Male       Prof
1     Male       Prof
2     Male       Prof
3     Male       Prof
4     Male       Prof
..     ...        ...
73  Female       Prof
74  Female  AssocProf
75  Female       Prof
76  Female       Prof
77  Female       Prof

[78 rows x 2 columns]

In [57]:
#Display the last 5 records
# <your code goes here>
df.tail(5)

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [58]:
#Identify the type of df object
#type(df)
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [59]:
#Check the type of a column "salary"
df['salary'].dtype

dtype('int64')

In [60]:
#List the types of all columns
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [61]:
#List the column names
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [62]:
#List the row labels and the column names
df.axes

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [63]:
#Number of dimensions
df.ndim

2

In [64]:
#Total number of elements in the Data Frame
df.size

468

In [65]:
#Number of rows and columns
df.shape

(78, 6)

In [66]:
#Output basic statistics for the numeric columns
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [67]:
#Calculate mean for all numeric columns
df.mean(numeric_only=True) #for pandas version 2.2.2
#df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [68]:
#Calculate mean for service columns
#df['service'].mean()
np.mean(df['service'])

15.051282051282051

# Exercise

In [70]:
np.sort(df.salary)

array([ 57800,  62884,  63100,  71065,  72500,  72500,  73000,  73300,
        73500,  74692,  74830,  75044,  77000,  77500,  77500,  78500,
        80225,  81285,  85000,  88000,  90450,  91000,  91000,  91100,
        91300,  92000,  92000,  92000,  93000,  94350,  97032,  99418,
       102000, 103106, 103275, 103613, 103750, 103994, 104542, 104800,
       105000, 105450, 107008, 107300, 109646, 109650, 109954, 110515,
       111512, 116450, 117555, 119800, 120000, 122400, 122960, 123683,
       124312, 126300, 126933, 127512, 128250, 129000, 131205, 134778,
       137000, 140096, 144651, 146856, 148750, 150480, 150500, 151768,
       153750, 155750, 155865, 161101, 162200, 186960], dtype=int64)

In [71]:
print(sorted(df.salary, reverse=True))

[186960, 162200, 161101, 155865, 155750, 153750, 151768, 150500, 150480, 148750, 146856, 144651, 140096, 137000, 134778, 131205, 129000, 128250, 127512, 126933, 126300, 124312, 123683, 122960, 122400, 120000, 119800, 117555, 116450, 111512, 110515, 109954, 109650, 109646, 107300, 107008, 105450, 105000, 104800, 104542, 103994, 103750, 103613, 103275, 103106, 102000, 99418, 97032, 94350, 93000, 92000, 92000, 92000, 91300, 91100, 91000, 91000, 90450, 88000, 85000, 81285, 80225, 78500, 77500, 77500, 77000, 75044, 74830, 74692, 73500, 73300, 73000, 72500, 72500, 71065, 63100, 62884, 57800]

In [72]:
#Calculate the standard deviation (std() method) for all numeric columns
df.std(numeric_only=True) #for pandas version 2.2.2

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [73]:
#Calculate average of the columns in the first 50 rows
# <your code goes here>
df.head(50).mean(numeric_only=True) #for pandas version 2.2.2

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [74]:
#Calculate how many values in the salary column (use count() method)
# <your code goes here>
df.count().salary

78

In [75]:
#Calculate the average salary
df['salary'].mean()

108023.78205128205

In [76]:
np.mean(df['salary'])

108023.78205128205

In [77]:
#Select column salary
df1 = df['salary']
df1.head()

0    186960
1     93000
2    110515
3    131205
4    104800
Name: salary, dtype: int64

# Sorting the data

In [ ]:
#Sort the data frame by yrs.service and create a new data frame
df_sorted = df.sort_values(by = 'service')
df_sorted.head()

In [ ]:
#Sort the data frame by yrs.service and overwrite the original dataset
df.sort_values(by = 'service', ascending = False, inplace = True)
df.head()